{
    "id": 2,
    "title": "How I Built My Portfolio",
    "date": "Sep 2025",
    "excerpt": "A step-by-step explanation of building my personal portfolio using HTML, CSS, and JSON-driven blog posts.",
    "image": "assets/images/blog/portfolio.png",
    "content": "<h3>How I Built My Personal Portfolio Website</h3><p>Creating my personal portfolio was one of the most rewarding projects I have ever completed. It allowed me to combine my passion for technology, design and storytelling into one digital space that reflects who I am as a cybersecurity and cloud enthusiast.</p><p>I wanted my website to showcase not only my professional work but also my learning journey. From exploring web development to building cybersecurity skills through hand-on experience. I was going for a simple and manageable website.</p><h3>Planning and Design</h3><p>Before writing any code, I started with a simple plan of how my website will look like, the structure and pages. I focused on sections that tell my story clearly:</p><ul><li><strong>Home/Landing Page:</strong></li><li><strong>Resume/About Me:</strong> My background, certifications and career focus.</li><li><strong>Projects:</strong> Hands-on cybersecurity and cloud labs.</li><li><strong>Blog:</strong> Articles about my experiences, certifications and achievements.</li><li><strong>Contact:</strong> To make it easy for professionals and recruiters to reach me.</li></ul><p>For design, I chose a modern and professional color scheme with whites, blacks and blue highlights.Colors that convey clarity and trust. My goal was a responsive layout that feels simple yet elegant.</p><h3>Development and Structure</h3><p>I built the portfolio using <strong>HTML</strong>, <strong>CSS</strong>, and <strong>JavaScript</strong>. I used <strong>JSON</strong> files to store and manage my blog posts, so I can easily update or add new content without editing the code directly.</p><p>Each blog post is stored as a separate JSON file and the blog page automatically loads them dynamically. This approach makes the website lightweight and easy to maintain.</p><h3>Hosting and Deployment</h3><p>After completing development, I hosted my portfolio on <strong>GitHub Pages</strong>, which provides free and reliable hosting for static sites. I did so by uploading it to a repository named <strong><i>&lt;username&gt;.github.io</i></strong>, which uses the same name as my GitHub username. This setup makes it easy to publish and update my site. Every time I make changes locally, I simply push new commits to GitHub. GitHub Actions then handles the entire CI/CD process by automatically testing, building and deploying my code.</p><h3>Key Features</h3><ul><li>Dynamic blog posts powered by JSON files.</li><li>Responsive design that works on all devices.</li><li>Lightweight and fast - No heavy frameworks.</li><li>Simple content management - just edit or add a JSON file.</li></ul><h3>Lessons Learned</h3><p>This project taught me how structure, usability and performance come together to create a meaningful user experience. I also strengthened my skills in:</p><ul><li>DOM manipulation with JavaScript.</li><li>JSON-based content management.</li><li>Clean and modular web design.</li><li>Version control with Git and GitHub.</li></ul><h3>What’s Next</h3><p>Building this site inspired me to think bigger. I plan to expand it into a personal cybersecurity learning hub, where I will share my CTF write-ups, security labs and certification insights. Growth happens step by step."
}