{
    "id": 3,
    "title": "Awarded - Best Female Security Engineer",
    "date": "Oct 2025",
    "excerpt": "Honored to Be Recognized as the Best Security Engineer by Cyber Shujaa .",
    "image": "assets/images/blog/grad.jpeg",
    "content": "<p>I was awarded the Best Security Engineer title by <strong> Irene Githinji - (Ecosystem Lead- Africa Development Center at Microsoft) </strong> during the 2nd Cyber Shujaa Cohort Graduation ceremony, in Partnership with Microsoft ADC.A moment that marks one of the most rewarding milestones in my cybersecurity journey.</p><h3> A Journey of Growth and Resilience</h3><p>When I joined the Cyber Shujaa program, I set out not only to strengthen my technical expertise but also to challenge myself to think critically about cybersecurity’s evolving landscape. The program provided a dynamic environment where learning met practice.</p><p>My path focused on SC 900(understanding the concepts of security,identity and compliance) and AZ 104(Azure Administration). With AZ 104, I deepened my technical expertise in Azure administration through managing resources, configuring (storage, virtual machines and networking),governance and implementing role-based access control (RBAC) for secure environments.</p><p>These skills proved invaluable throughout the program, especially during hands-on labs focused on:</p><ul><li>Configuring and securing Azure resources</li><li>Integrating Microsoft Sentinel for threat detection</li><li>Responding to simulated cloud security incidents</li></ul><p>Every lab, project and late-night troubleshooting session became a stepping stone toward growth. It wasn’t always easy, but those challenges shaped me into a more confident and skilled security engineer.</p><h3>About the Cyber Shujaa Program</h3><p>Cyber Shujaa is a partnership initiative dedicated to addressing the cybersecurity talent gap in Africa by equipping young professionals with practical, industry-ready skills. Being part of this program allowed me to learn from top industry experts, collaborate with peers who share a passion for digital defense and gain real-world exposure to the kinds of threats and solutions shaping today’s cybersecurity field.</p><h3>The Award and What It Means</h3><p>Receiving the Best Security Engineer award is a humbling recognition of the effort, curiosity and persistence I have invested in this field. But more than a personal achievement, it represents the collective spirit of teamwork, mentorship and community that Cyber Shujaa fosters.</p><h3>Looking Ahead</h3><p>This recognition has fueled my determination to continue advancing my career in cybersecurity  with a focus on threat detection, SOC operations and cloud security. I am eager to keep learning, contribute and inspire others to explore opportunities in this exciting field.</p><p>Next, I plan to advance my learning with:</p><ul><li>Doing more cybersecurity practices and hands-on and showcase them here.</li><li>AZ-500: Microsoft Azure Security Engineer Associate</li><li>Comptia Security+</li></ul><p>These steps will help me grow from foundational knowledge to advanced threat detection, SOC operations and cloud defense strategies.</p><h3>Gratitude</h3><p>A heartfelt thank you to the Cyber Shujaa team, mentors, and fellow participants for their constant support and encouragement. I am truly proud to be part of a community that’s building Africa’s next generation of cybersecurity professionals.</p>"
}